; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	satellite5 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	spectrograph0 - mode
	spectrograph2 - mode
	image1 - mode
	Star0 - direction
	GroundStation6 - direction
	GroundStation4 - direction
	GroundStation1 - direction
	Star8 - direction
	GroundStation2 - direction
	GroundStation5 - direction
	GroundStation3 - direction
	Star7 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Planet11 - direction
	Planet12 - direction
	Planet13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation4)
	(calibration_target instrument0 GroundStation6)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 spectrograph2)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
	(supports instrument2 spectrograph2)
	(supports instrument2 spectrograph0)
	(supports instrument2 image1)
	(calibration_target instrument2 Star7)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 Star8)
	(supports instrument3 spectrograph2)
	(supports instrument3 spectrograph0)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet13)
	(supports instrument4 spectrograph2)
	(supports instrument4 spectrograph0)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation5)
	(calibration_target instrument4 GroundStation2)
	(calibration_target instrument4 Star8)
	(supports instrument5 image1)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 GroundStation5)
	(calibration_target instrument5 Star7)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation2)
	(supports instrument6 image1)
	(supports instrument6 spectrograph2)
	(calibration_target instrument6 GroundStation1)
	(supports instrument7 spectrograph0)
	(supports instrument7 image1)
	(supports instrument7 spectrograph2)
	(calibration_target instrument7 GroundStation2)
	(calibration_target instrument7 GroundStation6)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation3)
	(supports instrument8 spectrograph2)
	(calibration_target instrument8 GroundStation1)
	(calibration_target instrument8 GroundStation4)
	(calibration_target instrument8 Star8)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet14)
	(supports instrument9 spectrograph2)
	(calibration_target instrument9 GroundStation2)
	(calibration_target instrument9 Star8)
	(supports instrument10 spectrograph0)
	(supports instrument10 spectrograph2)
	(supports instrument10 image1)
	(calibration_target instrument10 GroundStation3)
	(calibration_target instrument10 GroundStation5)
	(calibration_target instrument10 Star7)
	(supports instrument11 spectrograph2)
	(calibration_target instrument11 Star7)
	(on_board instrument9 satellite5)
	(on_board instrument10 satellite5)
	(on_board instrument11 satellite5)
	(power_avail satellite5)
	(pointing satellite5 GroundStation6)
)
(:goal (and
	(pointing satellite1 Star7)
	(pointing satellite2 Planet12)
	(pointing satellite4 Star7)
	(have_image Phenomenon9 image1)
	(have_image Planet10 image1)
	(have_image Planet11 spectrograph2)
	(have_image Planet12 image1)
	(have_image Planet13 image1)
	(have_image Planet14 spectrograph0)
))

)

; plan
1. (turn_to satellite4 star7 planet14)
   deleted: (pointing satellite4 planet14)
   added: (pointing satellite4 star7)
   goals met: 1 of 9
2. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 1 of 9
3. (calibrate satellite2 instrument4 groundstation2)
   added: (calibrated instrument4)
   goals met: 1 of 9
4. (turn_to satellite2 planet11 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 planet11)
   goals met: 1 of 9
5. (take_image satellite2 planet11 instrument4 spectrograph2)
   added: (have_image planet11 spectrograph2)
   goals met: 2 of 9
6. (turn_to satellite2 planet10 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 planet10)
   goals met: 2 of 9
7. (take_image satellite2 planet10 instrument4 image1)
   added: (have_image planet10 image1)
   goals met: 3 of 9
8. (turn_to satellite2 phenomenon9 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 phenomenon9)
   goals met: 3 of 9
9. (turn_to satellite1 star7 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 star7)
   goals met: 4 of 9
10. (take_image satellite2 phenomenon9 instrument4 image1)
   added: (have_image phenomenon9 image1)
   goals met: 5 of 9
11. (turn_to satellite2 planet13 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 planet13)
   goals met: 5 of 9
12. (take_image satellite2 planet13 instrument4 image1)
   added: (have_image planet13 image1)
   goals met: 6 of 9
13. (turn_to satellite2 planet14 planet13)
   deleted: (pointing satellite2 planet13)
   added: (pointing satellite2 planet14)
   goals met: 6 of 9
14. (take_image satellite2 planet14 instrument4 spectrograph0)
   added: (have_image planet14 spectrograph0)
   goals met: 7 of 9
15. (turn_to satellite2 planet12 planet14)
   deleted: (pointing satellite2 planet14)
   added: (pointing satellite2 planet12)
   goals met: 8 of 9
16. (take_image satellite2 planet12 instrument4 image1)
   added: (have_image planet12 image1)
   goals met: 9 of 9
